Repository: 84000/data-translation-memory
Catalog: toh178-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Teaching on the Aids to Enlightenment

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་ལྔ་བརྒྱ་ཙམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱམས་པ་དང་། འཇམ་དཔལ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: The Bhagavān was residing on Vulture Peak Mountain in Rājagṛha accompanied by a great bhikṣu saṅgha of five hundred bhikṣus, and by bodhisattva mahāsattvas such as Maitreya and Mañjuśrī.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: At that time, the Bhagavān said to Youthful Mañjuśrī,

source: འཇམ་དཔལ་ཕྱིན་ཅི་ལོག་བཞི་པོ་དག་གིས་སེམས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པའི་སེམས་ཅན་རྣམས་འཕགས་པའི་བདེན་པ་བཞི་པོ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མ་མཐོང་བའི་ཕྱིར་འདི་ལྟར་ཡང་དག་པ་མ་ཡིན་པའི་འཁོར་བ་ལས་མི་འདའོ། །
en: “Mañjuśrī, having minds that are misguided by the four errors, sentient beings do not see the four truths of the noble ones as they really are, and therefore they do not transcend saṃsāra, which is actually unreal.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the Bhagavān had said this, Youthful Mañjuśrī requested the Bhagavān,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་དམིགས་ན་སེམས་ཅན་རྣམས་འཁོར་བ་ལས་མི་འདའ་བ་བཤད་དུ་གསོལ།
en: “Bhagavān, please explain how sentient beings perceive things and therefore do not transcend saṃsāra.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Bhagavān replied,

source: འཇམ་དཔལ་སེམས་ཅན་རྣམས་བདག་དང་། བདག་གིར་ཁས་ལེན་པའི་ཕྱིར་འཁོར་བ་ལས་མི་འདའོ། །
en: “Mañjuśrī, it is because they assume a self and something that belongs to a self that sentient beings do not transcend saṃsāra.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that so?

source: འཇམ་དཔལ་སུ་བདག་དང་གཞན་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དེ་ལས་མངོན་པར་འདུ་བྱེད་པར་འགྱུར་བའི་ཕྱིར་རོ། །
en: Mañjuśrī, it is because anyone who considers things in terms of self and other will bring about karma.

source: འཇམ་དཔལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐོས་པ་དང་མི་ལྡན་པ་ནི་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་རབ་ཏུ་མི་ཤེས་ཏེ། བདག་དང་གཞན་དུ་དམིགས་སོ། །
en: Mañjuśrī, unlearned and ignorant ordinary beings, not knowing that all phenomena have completely passed into nirvāṇa, perceive them in terms of self and other.

source: དམིགས་ནས་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་རྣམ་པ་གསུམ་མངོན་པར་འདུ་བྱེད་དོ། །
en: With that perception, they bring about the three types of karma: corporeal, verbal, and mental.

source: དེ་མེད་པ་ལ་སྒྲོ་བཏགས་ནས་བདག་འདོད་ཆགས་སོ། །བདག་ཞེ་སྡང་ངོ་། །བདག་གཏི་མུག་གོ་ཞེས་རྣམ་པར་རྟོག་གོ། །
en: Reifying what does not exist, they think, ‘I am attached,’ ‘I am averse,’ ‘I am perplexed.’

source: གལ་ཏེ་དེ་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “If they go forth under the dispensation of the Tathāgata, they think to themselves,

source: བདག་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པ།
en: ‘I possess ethics,’

source: བདག་ནི་ཚངས་པར་སྤྱོད་པ་སྟེ།
en: ‘I practice the spiritual life,’

source: བདག་འཁོར་བ་ལས་འདའ་བར་བྱའོ། །
en: ‘I shall transcend saṃsāra,’

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྗེས་སུ་ཐོབ་པར་བྱའོ། །
en: ‘I shall attain complete nirvāṇa,’

source: བདག་སྡུག་བསྔལ་རྣམས་ལས་ཐར་བར་བྱའོ་
en: ‘I shall become liberated from suffering.’

source: དེ་ཆོས་འདི་དག་ནི་དགེ་བ་དག་གོ། །
en: ‘These phenomena are virtuous,’

source: ཆོས་འདི་དག་ནི་མི་དགེ་བ་དག་གོ་
en: ‘Those phenomena are nonvirtuous.’

source: སྙམ་དུ་རྟོག་གོ། །
en: “They think,

source: དེ་ཆོས་འདི་དག་ནི་སྤང་བར་བྱ་བ་དག་གོ། །
en: ‘These phenomena are to be abandoned,’

source: ཆོས་འདི་དག་ནི་མངོན་དུ་བྱ་བ་དག་གོ། །
en: ‘Those phenomena are to be brought about,’

source: སྡུག་བསྔལ་ནི་ཡོངས་སུ་ཤེས་པར་བྱ་བའོ། །
en: ‘Suffering is to be known,’

source: ཀུན་འབྱུང་བ་ནི་སྤང་བར་བྱ་བའོ། །
en: ‘Its origin is to be abandoned,’

source: འགོག་པ་ནི་མངོན་སུམ་དུ་བྱ་བའོ། །
en: ‘Its cessation is to be realized,’

source: ལམ་ནི་བསྒོམ་པར་བྱ་བའོ་
en: ‘The path is to be cultivated.’

source: དེ་འདུ་བྱེད་རྣམས་ནི་མི་རྟག་པ། འདུ་བྱེད་རྣམས་ནི་སྡུག་བསྔལ་བ། འདུ་བྱེད་རྣམས་ནི་ཀུན་ཏུ་འབར་བ་སྟེ།
en: ‘Conditioned states are impermanent,’ ‘Conditioned states are miserable,’ ‘Conditioned states are burning,’

source: འདུ་བྱེད་རྣམས་ལས་བདག་འབྲོས་པར་བྱའོ་སྙམ་དུ་རྟོག་གོ། །
en: “They think, ‘I shall escape from conditioned states.’

source: དེས་དེ་ལྟར་བརྟགས་པས་མཚན་མ་སྔོན་དུ་འགྲོ་བའི་ཡིད་འབྱུང་བ་དང་ལྡན་པ། མཚན་མ་སྔོན་དུ་འགྲོ་བའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པ་དག་སྐྱེའོ། །
en: “Through concepts of this kind, they acquire a disenchantment induced by phenomenal characteristics, and they bring to mind notions induced by phenomenal characteristics.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: With such thoughts, they think to themselves,

source: གང་ཆོས་འདི་དག་ཡོངས་སུ་ཤེས་པ་དེ་ནི་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པའོ་སྙམ་མོ། །
en: ‘One who knows those phenomena is someone who knows suffering.’

source: བདག་གིས་ཀུན་འབྱུང་བ་སྤང་བར་བྱའོ་སྙམ་ནས་དེ་ཆོས་ཐམས་ཅད་ཀྱིས་ཉེན་ཏེ་མ་རྟོགས་སོ། །སྐྲག་གོ། །དངང་ངོ་། །དངང་བར་འགྱུར་རོ། །
en: ‘I must abandon the origin.’ They are disturbed by all those phenomena, and do not understand them; they are afraid, terrified, and will be further terrified.

source: ཆོས་དེ་དག་མངོན་དུ་བྱེད་པ་གང་ཡིན་པ་དང་། ཆོས་དེ་དག་གིས་ཉེན་པ་གང་ཡིན་པ་དེ་ནི། ཀུན་འབྱུང་བ་སྤོང་བའོ་སྙམ་མོ། །
en: ‘The bringing about of these phenomena, and being disturbed by those phenomena—these things are the origin that is abandoned.’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་འགོག་པ་མངོན་སུམ་དུ་བྱའོ་སྙམ་ནས་
en: “With that thought, they then think, ‘I must actualize cessation,’ and

source: དེས་ཆོས་དེ་དག་བརྟགས་ཏེ་འགོག་པ་ཡིན་པ་སྙམ་དུ་ཤེས་སོ། །
en: they think, having investigated those phenomena, that they understand what cessation is.

source: འདི་དག་ནི་འགོག་པ་མངོན་སུམ་དུ་བྱེད་པའོ་སྙམ་མོ། །
en: ‘These are the things that actualize cessation.’

source: བདག་གིས་ལམ་བསྒོམ་པར་བྱའོ་
en: ‘I must cultivate the path.’

source: དེ་གཅིག་པུ་དབེན་པར་སོང་སྟེ།
en: They go alone to an isolated place, and,

source: ཆོས་དེ་དག་ཡིད་ལ་བྱེད་པས་ཞི་གནས་འཐོབ་བོ། །
en: by holding those phenomena in mind, they attain tranquility.

source: དེ་ཡིད་འབྱུང་བ་ཡིད་ལ་བྱེད་པ་དེ་དང་ཞི་གནས་འཐོབ་པ་དེས་ཆོས་ཐམས་ཅད་དང་སེམས་འགྲས་སོ། །
en: Holding that disenchantment in mind and having attained tranquility, they disapprove of all phenomena,

source: འབྲལ་ལོ། །
en: part from them,

source: ལྡོག་གོ། །
en: turn away from them,

source: ལོག་ནས་མངོན་པར་མི་དགའ་བའི་སེམས་བསྐྱེད་དོ། །
en: and, having withdrawn from them, they produce a mind of dislike.

source: བདག་ནི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཐར་ཏེ། བདག་གིས་ཡང་གོང་དུ་བྱ་བ་ཅི་ཞིག་ཡོད་ཀྱིས་བདག་ནི་དགྲ་བཅོམ་པའོ་
en: ‘I am liberated from all suffering; what more is there for me to do? I am an arhat.’

source: བདག་ཉིད་ཀྱིས་ཤེས་པ་ལས་དེ་འཆི་བའི་དུས་ཀྱི་ཚེ་སྐྱེ་བ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ནས་དེ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་དོགས་པ་དང་། ཡིད་གཉིས་དང་། ཐེ་ཙོམ་ཟའོ། །
en: Based on this presumption, when at the time of death they see their coming rebirth they become apprehensive, uncertain, and doubtful about the Buddha’s enlightenment.

source: དེ་ཐེ་ཙོམ་དུ་ལྟུང་བའི་སེམས་ཀྱིས་འཆི་བའི་དུས་བྱས་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རྣམས་སུ་སྐྱེའོ། །
en: Having died with a mind mired in doubt, they are born in the great hells.

source: དེ་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་ལ་རྣམ་པར་བརྟགས་པའི་ཕྱིར་རོ། །
en: It is because they conceive of all those phenomena, which are actually unproduced.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Youthful Mañjuśrī then asked the Bhagavān,

source: བཅོམ་ལྡན་འདས་འཕགས་པའི་བདེན་པ་བཞི་པོ་དག་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: “Bhagavān, how should one view the four truths of the noble ones?”

source: བཀའ་སྩལ་པ།
en: The Bhagavān replied,

source: འཇམ་དཔལ་སུས་འདུ་བྱེད་ཐམས་ཅད་སྐྱེ་བ་མེད་པར་མཐོང་བ་དེས་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་སོ། །
en: “Mañjuśrī, whoever sees all conditioned states as unproduced has understood suffering.

source: སུས་ཆོས་ཐམས་ཅད་འབྱུང་བ་མེད་པར་མཐོང་བ་དེས་ཀུན་འབྱུང་བ་སྤངས་སོ། །
en: Whoever sees all phenomena as unarisen has abandoned its origin.

source: སུས་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་མཐོང་བ་དེས་འགོག་པ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Whoever sees all phenomena as having completely passed into nirvāṇa has realized cessation.

source: སུས་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པར་མཐོང་བ་དེས་ལམ་བསྒོམས་སོ། །
en: Whoever sees all phenomena as having no existence has cultivated the path.

source: འཇམ་དཔལ་སུས་འཕགས་པའི་བདེན་པ་བཞི་པོ་དག་འདི་ལྟ་བུར་མཐོང་བ་དེ་ཆོས་འདི་དག་ནི་དགེ་བ་དག་གོ། །ཆོས་འདི་དག་ནི་མི་དགེ་བ་དག་གོ། །ཆོས་འདི་དག་ནི་སྤང་བར་བྱ་བ་དག་གོ། །ཆོས་འདི་དག་ནི་མངོན་སུམ་དུ་བྱ་བ་དག་གོ། །སྡུག་བསྔལ་ནི་ཡོངས་སུ་ཤེས་པར་བྱ་བའོ། །ཀུན་འབྱུང་བ་ནི་སྤང་བར་བྱ་བའོ། །འགོག་པ་ནི་མངོན་སུམ་དུ་བྱ་བའོ། །ལམ་ནི་བསྒོམ་པར་བྱ་བའོ་སྙམ་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ། །
en: “Mañjuśrī, whoever sees the four truths of the noble ones in this way does not mentally construct and conceptualize, thinking, ‘These phenomena are virtuous,’ ‘Those phenomena are nonvirtuous,’ ‘These phenomena are to be abandoned,’ ‘Those phenomena are to be realized,’ ‘Suffering is to be known,’ ‘Its origin is to be abandoned,’ ‘Its cessation is to be realized,’ ‘The path is to be cultivated.’

source: གང་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ཆགས་པ་དང་། ཞེ་སྡང་བ་དང་། གཏི་མུག་པའི་ཆོས་དེ་མ་སྐྱེས་པར་དེས་མཐོང་ཞིང་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པ་དང་། རྣམ་པར་བསྒྲུབས་པར་མཐོང་བའི་ཕྱིར་ཏེ།
en: It is because they see those phenomena to which ignorant ordinary beings become attached, averse, and perplexed as unproduced, and because they see them as falsely imagined and fabricated.

source: ཆོས་དེ་གང་ཡང་མི་ལེན་ཏོ། །མི་འདོར་རོ། །
en: So they do not adopt those phenomena at all, nor do they reject them.

source: དེ་ཁམས་གསུམ་པ་ལ་སེམས་མི་ཆགས་ཏེ།
en: “Mentally unattached to the three realms,

source: ཁམས་གསུམ་པ་ཐམས་ཅད་མ་སྐྱེས་པ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། རྨི་ལམ་ལྟ་བུ་དང་། བྲག་ཅ་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུར་མཐོང་ངོ་། །
en: they see all three realms as unproduced, like an illusion, a dream, an echo, and a visual aberration.

source: དེས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དེ་ལྟར་མཐོང་བས་སེམས་ཅན་ཐམས་ཅད་ལ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བར་འགྱུར་རོ། །
en: “By seeing the nature of all phenomena in that way, they will become free from attachment and aversion toward all sentient beings.

source: དེས་གང་ལ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བར་འགྱུར་བའི་ཆོས་དེ་མི་དམིགས་ཏེ།
en: They do not perceive the phenomena toward which they would have attachment or aversion.

source: དེས་ནམ་མཁའ་དང་མཚུངས་པའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: With minds equal to space, they do not perceive even the Buddha,

source: ཆོས་དང་། དགེ་འདུན་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: nor do they perceive even the Dharma or the Saṅgha.

source: དེས་ཆོས་ཐམས་ཅད་སྟོང་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཆོས་གང་དག་ལའང་ཐེ་ཚོམ་མི་ཟའོ། །
en: They do not perceive all phenomena as empty, nor do they harbor doubt regarding any phenomenon.

source: ཐེ་ཚོམ་མི་ཟ་བས་ཉེ་བར་ལེན་པར་མི་འགྱུར་རོ། །
en: Because they do not harbor doubt, they will not appropriate.

source: ཉེ་བར་མི་ལེན་པས་ལེན་པ་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: Because they do not appropriate, they will attain complete nirvāṇa without further appropriation.

source: འཇམ་དཔལ་དགེ་སློང་རབ་འབྱོར་གྱིས་ཆོས་ཐམས་ཅད་རྣམ་པ་དེ་ལྟ་བུར་ཤེས་པས་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་ཕྱག་འཚལ་དུ་མི་འོང་ངོ་། །
en: “Mañjuśrī, bhikṣu Subhūti understands all phenomena in such a way, and therefore he does not come to prostrate at the feet of the Tathāgata.

source: བདག་ཉིད་ཀྱང་མི་དམིགས་ན་དེ་བཞིན་གཤེགས་པ་དམིགས་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ། དེ་ནི་གནས་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: It is because it would be impossible—if he does not perceive even himself, how would he perceive the Tathāgata?”

source: བཅོམ་ལྡན་འདས་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་པོ་དག་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: “Bhagavān, how should one view the four applications of mindfulness?”

source: འཇམ་དཔལ་མ་འོངས་པའི་དུས་ན་དགེ་སློང་དག་མི་སྡུག་པའི་རྣམ་པར་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྟོན་པར་འགྱུར།
en: “Mañjuśrī, in the future I will teach the bhikṣus the application of mindfulness that carefully considers the body in its ugly aspect.

source: སྐྱེ་བ་དང་འགོག་པར་ཚོར་བ་རྣམས་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྟོན་པར་འགྱུར།
en: I will teach the application of mindfulness that carefully considers feelings as arising and ceasing.

source: སེམས་ལ་སྐྱེ་བའི་ཆོས་དང་། འགག་པའི་ཆོས་སུ་བལྟའོ་སྙམ་དུ་དེ་ལྟར་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྟོན་པར་འགྱུར།
en: I will teach the application of mindfulness that carefully considers the mind in this way: ‘Regard the mind as having the quality of arising and the quality of ceasing.’

source: གང་རིལ་པོར་འདུ་ཤེས་པར་མི་འགྱུར་བ་དེ་ལྟར་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྟོན་པར་འགྱུར་བ་དེ་དག་འབྱུང་ངོ་། །
en: I will teach the application of mindfulness that carefully considers phenomena in such a way that there will be no notion of them as wholes. These teachings will take place.”

source: བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the Bhagavān had said this, Youthful Mañjuśrī asked the Bhagavān,

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་ཤེས་པར་དཀའ་ཡིས་ཐོང་ཤིག །
en: “Mañjuśrī, regard them in terms of the allusive speech of the Tathāgata, which is difficult to understand.”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ།
en: requested Mañjuśrī.

source: བཅོམ་ལྡན་འདས་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་བཤད་དུ་གསོལ།
en: “Bhagavān, please explain how to cultivate the four applications of mindfulness,”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་ལུས་ནམ་མཁའ་དང་འདྲ་བར་མཐོང་བ་འདི་ནི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པའོ། །
en: “Mañjuśrī,” replied the Bhagavān, “regarding the body to be like space is the application of mindfulness that carefully considers the body.

source: འཇམ་དཔལ་སུས་ཚོར་བ་ནང་ན་ཡང་མ་ཡིན། ཕྱི་རོལ་ན་ཡང་མ་ཡིན་ཞིང་གཉི་ག་མེད་པ་ལ་ཡང་མི་དམིགས་པ་འདི་ནི་ཚོར་བ་རྣམས་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པའོ། །
en: “Mañjuśrī, whoever does not perceive feelings—which, being neither inside, nor outside, are non-existent in both—is applying mindfulness that carefully considers feelings.

source: འཇམ་དཔལ་སུས་སེམས་ལ་མིང་ཙམ་དུ་ཟད་པར་ཤེས་པ་འདི་ནི་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པའོ། །
en: “Mañjuśrī, whoever understands mind to be no more than a mere name is applying mindfulness that carefully considers the mind.

source: འཇམ་དཔལ་སུས་དགེ་བ་དང་། མི་དགེ་བ་དང་ལུང་དུ་མ་བསྟན་པའི་ཆོས་མི་དམིགས་པ་འདི་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྟེ།
en: “Mañjuśrī, whoever does not perceive virtuous, nonvirtuous, or neutral phenomena is applying mindfulness that carefully considers phenomena.

source: འཇམ་དཔལ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་པོ་དག་ནི་དེ་ལྟར་བལྟ་བར་བྱའོ། །
en: “Mañjuśrī, this is how the four applications of mindfulness are to be viewed.”

source: བཅོམ་ལྡན་འདས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: “Bhagavān, how should one view the eightfold path of the noble ones?”

source: འཇམ་དཔལ་སུས་ཆོས་ཐམས་ཅད་མི་མཉམ་པ་མེད་ལ་གཉིས་སུ་མེད་ཅིང་། གཉིས་སུ་དབྱེར་མེད་པར་མཐོང་བ་འདི་ནི་ཡང་དག་པའི་ལྟ་བའོ། །
en: “Mañjuśrī, whoever sees all phenomena as not unequal, nondual, and not dualistically distinguishable has right view.

source: འཇམ་དཔལ་སུས་མི་མཐོང་བའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་མི་རྟོག་རྣམ་པར་མི་རྟོག །ཀུན་ཏུ་མི་རྟོག་པར་མཐོང་བ་འདི་ནི་ཡང་དག་པའི་རྟོག་པའོ། །
en: “Mañjuśrī, whoever sees by way of not seeing—without conceptualizing, mentally constructing, or falsely imagining any phenomenon—has right intention.

source: འཇམ་དཔལ་སུས་བརྗོད་པ་མཉམ་པ་ཉིད་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་བརྗོད་དུ་མེད་པར་མཐོང་བ་འདི་ནི་ཡང་དག་པའི་ངག་གོ། །
en: “Mañjuśrī, whoever sees all phenomena as inexpressible due to having meditated on the sameness of all expressions has right speech.

source: འཇམ་དཔལ་སུས་བྱེད་པ་པོ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་བྱ་བ་མེད་པ་དང་བྱེད་པ་མེད་པར་མཐོང་བ་འདི་ནི་ཡང་དག་པའི་ལས་ཀྱི་མཐའོ། །
en: “Mañjuśrī, whoever sees all phenomena as free from action and instrument due to not perceiving an agent has right action.

source: འཇམ་དཔལ་སུས་འཚོ་བ་མཉམ་པ་ཉིད་དུ་གནས་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་འཕེལ་བར་ཡང་མི་བྱེད། འགྲིབ་པར་ཡང་མི་བྱེད་པ་འདི་ནི་ཡང་དག་པའི་འཚོ་བའོ། །
en: “Mañjuśrī, whoever does not act to increase or decrease any phenomenon due to abiding in the sameness of all livelihoods has right livelihood.

source: འཇམ་དཔལ་སུས་རྩོམ་པ་མེད་པར་བརྟུལ་བའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ཀུན་ནས་མི་སློང་བ་འདི་ནི་ཡང་དག་པའི་རྩོལ་བའོ། །
en: “Mañjuśrī, whoever, by way of applying themselves without exertion, does not initiate anything has right effort.

source: འཇམ་དཔལ་དྲན་པའི་ལས་དབེན་པའི་ཕྱིར་སུས་ཆོས་ཐམས་ཅད་དྲན་པར་མི་བྱེད་པ་འདི་ནི་ཡང་དག་པའི་དྲན་པའོ། །
en: “Mañjuśrī, whoever is not mindful of any phenomenon due to being devoid of the act of mindfulness has right mindfulness.

source: འཇམ་དཔལ་སུས་དམིགས་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མཉམ་པར་བཞག་ཅིང་མ་འཁྲུགས་པར་མཐོང་བ་འདི་ནི་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏོ། །
en: “Mañjuśrī, whoever sees all phenomena as naturally meditatively concentrated and undisturbed due to not perceiving any object of perception has right meditative concentration.

source: འཇམ་དཔལ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་དེ་ལྟར་བལྟ་བར་བྱའོ། །
en: “Mañjuśrī, this is how the eightfold path of the noble ones is to be viewed.”

source: བཅོམ་ལྡན་འདས་དབང་པོ་ལྔ་པོ་དག་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: “Bhagavān, how should one view the five faculties?”

source: འཇམ་དཔལ་སུས་རང་བཞིན་གྱིས་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པར་མཐོང་བར་ཡིད་ཆེས་པ་འདི་ནི་དད་པའི་དབང་པོའོ། །
en: “Mañjuśrī, whoever has the confidence to see all phenomena as unproduced by virtue of their being intrinsically unproduced has the faculty of faith.

source: འཇམ་དཔལ་སུས་ཉེ་བའི་འདུ་ཤེས་དང་རིང་བའི་འདུ་ཤེས་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་སེམས་མི་གཏོང་བ་འདི་ནི་བརྩོན་འགྲུས་ཀྱི་དབང་པོའོ། །
en: “Mañjuśrī, whoever does not mentally let go of any phenomenon due to being free from notions of far or near has the faculty of effort.

source: འཇམ་དཔལ་སུས་དམིགས་པ་དབེན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཡིད་ལ་མི་བྱེད་ཅིང་དྲན་པ་མི་འདོད་པ་འདི་ནི་དྲན་པའི་དབང་པོའོ། །
en: “Mañjuśrī, whoever does not seek to bring to mind or to be mindful of any phenomenon due to being disengaged from objects of perception has the faculty of mindfulness.

source: འཇམ་དཔལ་སུས་གཉིས་སུ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་གཉིས་སུ་མེད་པར་འགྱུར་བ་འདི་ནི་ཏིང་ངེ་འཛིན་གྱི་དབང་པོའོ། །
en: “Mañjuśrī, whoever sees all phenomena as nondual on account of not perceiving dualistically has the faculty of meditative concentration.

source: འཇམ་དཔལ་སུས་སྐྱེ་བ་དང་བྲལ་བ་དང་། མི་ཤེས་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པར་མཐོང་བ་འདི་ནི་ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ་
en: “Mañjuśrī, whoever sees all phenomena as intrinsically empty due to being devoid of being produced and being devoid of not being known has the faculty of wisdom.

source: འཇམ་དཔལ་དབང་པོ་ལྔ་པོ་དག་ནི་དེ་ལྟར་བལྟ་བར་བྱའོ། །
en: “Mañjuśrī, this is how the five faculties should be viewed.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་པོ་དག་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: “Bhagavān, how should one view the seven branches of enlightenment?”

source: འཇམ་དཔལ་སུས་དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པར་མཐོང་བ་འདི་ནི་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གོ། །
en: “Mañjuśrī, whoever sees all phenomena as devoid of existence because there is neither mindfulness nor attention has the branch of enlightenment of right mindfulness.

source: འཇམ་དཔལ་སུས་དགེ་བ་དང་། མི་དགེ་བ་དང་། ལུང་དུ་མ་བསྟན་པ་ཡོངས་སུ་མི་འགྲུབ་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་དབེན་ཞིང་མི་དམིགས་པ་འདི་ནི་ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གོ། །
en: “Mañjuśrī, whoever is disengaged from and does not perceive any phenomenon by not creating virtuous, nonvirtuous, or neutral states has the branch of enlightenment of right discernment of phenomena.

source: འཇམ་དཔལ་སུས་ཁམས་ཀྱི་འདུ་ཤེས་ཤིན་ཏུ་བཤིག་པའི་ཕྱིར་ཁམས་གསུམ་པ་མི་ལེན་མི་འདོར་བ་འདི་ནི་བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གོ། །
en: “Mañjuśrī, whoever neither adopts nor rejects the three realms due to having destroyed the notion of realms has the branch of enlightenment of right effort.

source: འཇམ་དཔལ་སུས་དགའ་བ་དང་། མི་དགའ་བ་རྣམ་པར་བཤིག་པའི་ཕྱིར་འདུ་བྱེད་ཐམས་ཅད་ལ་དགའ་བ་མི་སྐྱེད་པ་འདི་ནི་དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གོ། །
en: “Mañjuśrī, whoever does not become joyous about any conditioned state due to having done away with joy and sorrow has the branch of enlightenment of right joy.

source: འཇམ་དཔལ་སུས་དམིགས་པའི་དངོས་པོ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་སེམས་ཤིན་ཏུ་སྦྱངས་པར་གྱུར་པ་འདི་ནི་ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གོ། །
en: “Mañjuśrī, whoever is mentally supple with respect to all phenomena because of not perceiving objects of perception has the branch of enlightenment of right mental suppleness.

source: འཇམ་དཔལ་སུས་ཆོས་ཐམས་ཅད་རྣམ་པར་གཞིག་པ་རྗེས་སུ་རྟོགས་པའི་ཕྱིར་སེམས་མི་དམིགས་པ་འདི་ནི་ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གོ། །
en: “Mañjuśrī, whoever does not perceive mind because of realizing that all phenomena have come to an end has the branch of enlightenment of right meditative concentration.

source: འཇམ་དཔལ་སུས་ཆོས་ཐམས་ཅད་ལ་གནས་པར་མི་བྱེད། རྟེན་པར་མི་བྱེད། ཆགས་པར་མི་བྱེད། འཆིང་བར་མི་བྱེད་ཅིང་དེ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བའི་བཏང་སྙོམས་ཅན་དུ་གྱུར་ཏེ། དགའ་བ་ཐོབ་པ་འདི་ནི་བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ།
en: “Mañjuśrī, whoever does not rely on, depend on, or cleave to any phenomenon, and, acquiring the impartiality of not seeing any phenomenon, attains joy has the branch of enlightenment of right impartiality.

source: འཇམ་དཔལ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་པོ་དག་ནི་དེ་ལྟར་བལྟ་བར་བྱའོ། །
en: “Mañjuśrī, this is how the seven branches of enlightenment should be viewed.

source: འཇམ་དཔལ་གང་ལ་ལས་འཕགས་པའི་བདེན་པ་བཞི་པོ་དག་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་པོ་དག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དག་དང་། དབང་པོ་ལྔ་པོ་དག་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་པོ་དག་དེ་ལྟ་བུར་མཐོང་བ་འདི་ནི་རྒལ་བའོ་ཞེས་ང་སྨྲ་སྟེ
en: “Mañjuśrī, I proclaim that those who see the four truths of the noble ones, the four applications of mindfulness, the eightfold path of the noble ones, the five faculties, and the seven branches of enlightenment in such a manner have crossed over.

source: ཕ་རོལ་ཏུ་སོན་པའོ། །
en: they have gone to the other shore,

source: ཐང་ལ་གནས་པའོ། །
en: stand on dry land,

source: བདེ་བ་ཐོབ་པའོ། །
en: have reached happiness,

source: མི་འཇིགས་པ་ཐོབ་པའོ། །
en: have obtained fearlessness,

source: ཁུར་བོར་བའོ། །
en: have laid down their burden,

source: རྡུལ་དང་བྲལ་བའོ། །
en: are free from dust,

source: ཅི་ཡང་མེད་པའོ། །
en: have nothing whatsoever,

source: ཉོན་མོངས་པ་མེད་པའོ། །
en: are free of afflictions,

source: ལེན་པ་མེད་པའོ། །
en: have no further appropriation,

source: དགྲ་བཅོམ་པའོ། །
en: are arhats,

source: དགེ་སྦྱོང་ངོ་། །
en: are śramaṇas,

source: བྲམ་ཟེའོ། །
en: are brahmins,

source: བཀྲུས་པའོ། །
en: are cleansed,

source: རིག་པའོ། །
en: are knowers,

source: རིང་དུ་སོང་བའོ། །
en: are those who have gone afar,

source: གཙང་མའོ། །
en: are pure,

source: སངས་རྒྱས་ཀྱི་སྲས་སོ། །
en: are heirs of the Buddha,

source: ཤཱཀྱའི་སྲས་སོ། །
en: are Śākya heirs,

source: ཚེར་མ་དཀྲུགས་པའོ། །
en: have extracted the thorns,

source: འོབས་ལས་རྒལ་བའོ། །
en: have crossed the pit,

source: ཤིན་ཏུ་བརྟན་པའོ། །
en: are completely steady,

source: རིམས་ནད་མེད་པའོ། །
en: are free from fever,

source: དགེ་སློང་ངོ་། །
en: are bhikṣus,

source: འཕགས་པའོ། །
en: are noble ones,

source: རྒྱལ་མཚན་རྫོགས་པའོ་ཞེས་
en: and are perfect banners.

source: སྨྲའོ །_།
en: I proclaim that

source: འཇམ་དཔལ་བཟོད་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་སྦྱིན་གནས་ཡིན་ཏེ་རྙེད་པ་དང་། བཀུར་སྟིའི་འོས་ཀྱང་ཡིན་ནོ། །
en: “Mañjuśrī, those with such forbearance are deserving of offerings from the world with its gods—they are worthy of gifts and reverence.
